/***********************************************************************************
All content © 2018 DigiPen Institute of Technology Singapore, all rights reserved.

Filename:    Menu.c
Author(s):   Ying Ying (80%), Syafaat (20%)

Description/Features:
  This file contains the printed ASCII art for the introduction, main menu and
  help screens.
***********************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include "WindowsHelper.h"


/* Function for printing digipen logo */
void RenderDigiPenIntro(void)
{
	char UI[][80] ={
		{"                                _______                  ________              "},
		{"             /### /#######     |       \\                |        \\             "},
		{"             /### /#########   |        \\  _          _ |   ___   |            "},
		{"             /### /##########  |    |    ||_|        |_||         |            "},
		{"             /### /########### |    |    | _   ____   _ |    ____/____   _____ "},
		{"             /### /########### |    |    || | /    \\ | ||   |    /    \\ |     \\"},
		{"             /### /##########  |    |    || ||  __  || ||   |   |  --  ||     |"},
		{"             /### /#########   |        / | ||      || ||   |   |  ____||  |  |"},
		{"             /### /#######/    |_______/  |_| \\___  ||_||___|    \\____\\ |__|__|"},
		{"    /####### /### ///////                     /     |                          "},
		{"  /######### /###                             \\____/                           "},
		{" /########## /###                                                              "},
		{"/########### /###                                                              "},
		{"/########### /###      _____ ___   ___ __  _  __ ___ __ __       _     _  _    "},
		{"//########## /### ||\\||_  | | | | | | |__ | ||__  | |__|  |_||\\|| ||  | || _|_|"},
		{" //######### /### || |__| | | | |_| | |__ |_||    | |__|__| || ||_||__|_||_| | "},
		{"  ///####### /###                                                              "},
		{"    ///////  ///                                                               "},
	};

	int i, j = 0;
	for (j = 0; j < 18; ++j)
		for (i = 0; i < 80; ++i)
			WindowsHelper_DrawCharacterInPosition(RED, UI[j][i], i+35, j+11);
}

/* Function to print Team logo */
void RenderTeamIntro(void)
{
	char UI[][151] = {
		{"ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                              ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ                                              ÛÛ"},
		{"ÛÛ                                                   ÛÛ                                        ÛÛ                                                   ÛÛ"},
		{"ÛÛ                                                   ÛÛ                                        ÛÛ                                                   ÛÛ"},
		{"ÛÛ                                                   ÛÛ   ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ   ÛÛ                                                   ÛÛ"},
		{"ÛÛ                                                   ÛÛ    ÛÛ     ÛÛ             ÛÛ      ÛÛ    ÛÛ                                                   ÛÛ"},
		{"ÛÛ                                                   ÛÛ     ÛÛ  ÛÛÛ               ÛÛÛ   ÛÛ     ÛÛ                                                   ÛÛ"},
		{"ÛÛ                                                   ÛÛ      ÛÛÛÛ                   ÛÛÛÛ       ÛÛ                                                   ÛÛ"},
		{"ÛÛ                                                   ÛÛ      ÛÛÛ   ÛÛÛÛÛ     ÛÛÛÛÛ   ÛÛÛ       ÛÛ                                                   ÛÛ"},
		{"ÛÛ                                                   ÛÛ       ÛÛ                     ÛÛ        ÛÛ                                                   ÛÛ"},
		{"ÛÛ                                                   ÛÛ        ÛÛ      ÛÛÛÛÛÛÛ      ÛÛ         ÛÛ                                                   ÛÛ"},
		{"ÛÛ                                                   ÛÛ         ÛÛ      ÛÛÛÛÛ      ÛÛ          ÛÛ                                                   ÛÛ"},
		{"ÛÛ                                                   ÛÛ          ÛÛ      ÛÛÛ      ÛÛ           ÛÛ                                                   ÛÛ"},
		{"ÛÛ                                                   ÛÛ           ÛÛ    ÛÛÛÛÛ    ÛÛ            ÛÛ                                                   ÛÛ"},
		{"ÛÛ                                                   ÛÛ            ÛÛ  ÛÛ   ÛÛ  ÛÛ             ÛÛ                                                   ÛÛ"},
		{"ÛÛ                                                   ÛÛ             ÛÛÛÛ     ÛÛÛÛ              ÛÛ                                                   ÛÛ"},
		{"ÛÛ                                                   ÛÛ              ÛÛÛÛÛÛÛÛÛÛÛ               ÛÛ                                                   ÛÛ"},
		{"ÛÛ                                                   ÛÛ                                        ÛÛ                                                   ÛÛ"},
		{"ÛÛ                                                   ÛÛ                                        ÛÛ                                                   ÛÛ"},
		{"ÛÛ                                              ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ                                              ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                    ÜÛÛÛÛÛÛÛÛ ÜÛÛ   Ü    ÜÛÛÛÛÛÛÛÜ     ÜÛÛÛÛÛÛÛÛ                                                  ÛÛ"},
		{"ÛÛ                                                   ÛÛÛ    ÛÛÛ ÛÛÛ   ÛÛÜ ÛÛß     ÜÛÛ   ÛÛÛ    ÛÛÛ                                                  ÛÛ"},
		{"ÛÛ                                                   ÛÛÛ    Ûß  ÛÛÛÜÜÜÛÛÛ       ÜÛÛÛß   ÛÛÛ    Ûß                                                   ÛÛ"},
		{"ÛÛ                                                   ÛÛÛ        ßßßßßßÛÛÛ  ßÛßÜÛÛÛßÜÜ  ÜÛÛÛÜÜÜ                                                      ÛÛ"},
		{"ÛÛ                                                 ßÛÛÛÛÛÛÛÛÛÛÛ ÜÛÛ   ÛÛÛ   ÜÛÛÛß   ß ßßÛÛÛßßß                                                      ÛÛ"},
		{"ÛÛ                                                          ÛÛÛ ÛÛÛ   ÛÛÛ ÜÛÛÛß         ÛÛÛ    ÛÜ                                                   ÛÛ"},
		{"ÛÛ                                                    ÜÛ    ÛÛÛ ÛÛÛ   ÛÛÛ ÛÛÛÜ     ÜÛ   ÛÛÛ    ÛÛÛ                                                  ÛÛ"},
		{"ÛÛ                                                  ÜÛÛÛÛÛÛÛÛß   ßÛÛÛÛÛß   ßÛÛÛÛÛÛÛÛß   ÛÛÛÛÛÛÛÛÛÛ                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ"}
	};

	int i, j = 0;
	for (j = 0; j < 41; ++j)
		for (i = 0; i < 151; ++i)
			WindowsHelper_DrawCharacterInPosition(0x0F, UI[j][i], i, j);
}

/*Function to print main menu with 'PLAY' selection*/
void RenderMenuScreen_Cursor_NewGame(void)
{
	char UI[][151] = {
		{"ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                            ÛÛÛÛÛÛÛ»ÛÛÛÛÛÛ»  ÛÛÛÛÛ»  ÛÛÛÛÛÛ»ÛÛÛÛÛÛÛ»    ÛÛÛÛÛÛ»  ÛÛÛÛÛ» ÛÛÛ»   ÛÛ» ÛÛÛÛÛÛ» ÛÛÛÛÛÛÛ»ÛÛÛÛÛÛ»                        ÛÛ"},
		{"ÛÛ                            ÛÛÉÍÍÍÍ¼ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛ»ÛÛÉÍÍÍÍ¼ÛÛÉÍÍÍÍ¼    ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛ»ÛÛÛÛ»  ÛÛºÛÛÉÍÍÍÍ¼ ÛÛÉÍÍÍÍ¼ÛÛÉÍÍÛÛ»                       ÛÛ"},
		{"ÛÛ                            ÛÛÛÛÛÛÛ»ÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÛºÛÛº     ÛÛÛÛÛ»      ÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÛºÛÛÉÛÛ» ÛÛºÛÛº  ÛÛÛ»ÛÛÛÛÛ»  ÛÛÛÛÛÛÉ¼                       ÛÛ"},
		{"ÛÛ                            ÈÍÍÍÍÛÛºÛÛÉÍÍÍ¼ ÛÛÉÍÍÛÛºÛÛº     ÛÛÉÍÍ¼      ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛºÛÛºÈÛÛ»ÛÛºÛÛº   ÛÛºÛÛÉÍÍ¼  ÛÛÉÍÍÛÛ»                       ÛÛ"},
		{"ÛÛ                            ÛÛÛÛÛÛÛºÛÛº     ÛÛº  ÛÛºÈÛÛÛÛÛÛ»ÛÛÛÛÛÛÛ»    ÛÛº  ÛÛºÛÛº  ÛÛºÛÛº ÈÛÛÛÛºÈÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÛ»ÛÛº  ÛÛº                       ÛÛ"},
		{"ÛÛ                            ÈÍÍÍÍÍÍ¼ÈÍ¼     ÈÍ¼  ÈÍ¼ ÈÍÍÍÍÍ¼ÈÍÍÍÍÍÍ¼    ÈÍ¼  ÈÍ¼ÈÍ¼  ÈÍ¼ÈÍ¼  ÈÍÍÍ¼ ÈÍÍÍÍÍ¼ ÈÍÍÍÍÍÍ¼ÈÍ¼  ÈÍ¼                       ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                ÜÛ    ÛÜ     ÜÛÛÛÛÛÛÛÛß                                                           ÛÛ"},
		{"ÛÛ                                                               ÛÛÛ    ÛÛÛ   ÛÛÛ    Ûß                                                             ÛÛ"},
		{"ÛÛ                                                               ÛÛÛ    ÛÛÛ   ÛÛÛ                                                                   ÛÛ"},
		{"ÛÛ                                                               ÛÛÛ    ÛÛÛ ßÛÛÛÛÛÛÛÛÛÛÛ                                                            ÛÛ"},
		{"ÛÛ                                                                ÛÛÜ  ÜÛÛ           ÛÛÛ                                                            ÛÛ"},
		{"ÛÛ                                                                 ÛÛÜÜÛÛ     ÜÛ     ÛÛÛ                                                            ÛÛ"},
		{"ÛÛ                                                                  ßÛÛß   ÜÛÛÛÛÛÛÛÛß                                                               ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                 ÛÛÛÜ      ÛÛ²     ÛÛ²²ÛÛÛÛÛ  ÛÛÛÜ    Û   ÛÛÛÛÛÛ                                                  ÛÛ"},
		{"ÛÛ                                                ±ÛÛÛÛÛÜÜ  ²ÛÛ±    ²ÛÛ±²Û   ß  ÛÛ ßÛ   Û ±ÛÛ    ±                                                  ÛÛ"},
		{"ÛÛ                                                ±ÛÛ  ßÛÛÜ ±ÛÛ°    ±ÛÛ±±ÛÛÛ   ²ÛÛ  ßÛ ÛÛ±° ²ÛÛÜ                                                    ÛÛ"},
		{"ÛÛ                                                °ÛÛÜÜÜÜÛÛ ±ÛÛ°    °ÛÛ°±²Û  Û ²ÛÛ±  ßÛÛÛ±  ±   ÛÛ±                                                 ÛÛ"},
		{"ÛÛ                                                ²Û   ²ÛÛ±°ÛÛÛÛÛÛ±°ÛÛ°°±ÛÛÛÛÛ±ÛÛ°   ²ÛÛ°±ÛÛÛÛÛÛ±±                                                  ÛÛ"},
		{"ÛÛ                                                ±±   ²±Û°° ±°²  °°²  °° ±° °° ±°   ± ± ± ±²± ± °                                                  ÛÛ"},
		{"ÛÛ                                                ±   ±± °° ° ±  ° ± ° ° °  °° °°   ° ±°° °±  ° °                                                   ÛÛ"},
		{"ÛÛ                                                °   ±     ° °    ± °   °      °   ° ° °  °  °                                                     ÛÛ"},
		{"ÛÛ                                                    °  °    °  ° °     °  °         °       °                                                     ÛÛ"},
		{"ÛÛ                                                             ÉÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ»                                                             ÛÛ"},
		{"ÛÛ                                                             ºÛÛÛ>     PLAY     <ÛÛÛº                                                             ÛÛ"},
		{"ÛÛ                                                             ÈÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ¼                                                             ÛÛ"},
		{"ÛÛ                                                             ÉÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ»                                                             ÛÛ"},
		{"ÛÛ                                                             º     INSTRUCTIONS     º                                                             ÛÛ"},
		{"ÛÛ                                                             ÈÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼                                                             ÛÛ"},
		{"ÛÛ                                                             ÉÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ»                                                             ÛÛ"},
		{"ÛÛ                                                             º        CREDITS       º                                                             ÛÛ"},
		{"ÛÛ                                                             ÈÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼                                                             ÛÛ"},
		{"ÛÛ                                                             ÉÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ»                                                             ÛÛ"},
		{"ÛÛ                                                             º         QUIT         º                                                             ÛÛ"},
		{"ÛÛ                                                             ÈÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼                                                             ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ"}
	};

	int i, j = 0;
	for (j = 0; j < 41; ++j)
		for (i = 0; i < 151; ++i)
			WindowsHelper_DrawCharacterInPosition(0x0F, UI[j][i], i, j);
}

/*Function to print main menu with 'INSTRUCTIONS' selection*/
void RenderMenuScreen_Cursor_Instructions(void)
{
	char UI[][151] = {
		{"ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                            ÛÛÛÛÛÛÛ»ÛÛÛÛÛÛ»  ÛÛÛÛÛ»  ÛÛÛÛÛÛ»ÛÛÛÛÛÛÛ»    ÛÛÛÛÛÛ»  ÛÛÛÛÛ» ÛÛÛ»   ÛÛ» ÛÛÛÛÛÛ» ÛÛÛÛÛÛÛ»ÛÛÛÛÛÛ»                        ÛÛ"},
		{"ÛÛ                            ÛÛÉÍÍÍÍ¼ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛ»ÛÛÉÍÍÍÍ¼ÛÛÉÍÍÍÍ¼    ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛ»ÛÛÛÛ»  ÛÛºÛÛÉÍÍÍÍ¼ ÛÛÉÍÍÍÍ¼ÛÛÉÍÍÛÛ»                       ÛÛ"},
		{"ÛÛ                            ÛÛÛÛÛÛÛ»ÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÛºÛÛº     ÛÛÛÛÛ»      ÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÛºÛÛÉÛÛ» ÛÛºÛÛº  ÛÛÛ»ÛÛÛÛÛ»  ÛÛÛÛÛÛÉ¼                       ÛÛ"},
		{"ÛÛ                            ÈÍÍÍÍÛÛºÛÛÉÍÍÍ¼ ÛÛÉÍÍÛÛºÛÛº     ÛÛÉÍÍ¼      ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛºÛÛºÈÛÛ»ÛÛºÛÛº   ÛÛºÛÛÉÍÍ¼  ÛÛÉÍÍÛÛ»                       ÛÛ"},
		{"ÛÛ                            ÛÛÛÛÛÛÛºÛÛº     ÛÛº  ÛÛºÈÛÛÛÛÛÛ»ÛÛÛÛÛÛÛ»    ÛÛº  ÛÛºÛÛº  ÛÛºÛÛº ÈÛÛÛÛºÈÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÛ»ÛÛº  ÛÛº                       ÛÛ"},
		{"ÛÛ                            ÈÍÍÍÍÍÍ¼ÈÍ¼     ÈÍ¼  ÈÍ¼ ÈÍÍÍÍÍ¼ÈÍÍÍÍÍÍ¼    ÈÍ¼  ÈÍ¼ÈÍ¼  ÈÍ¼ÈÍ¼  ÈÍÍÍ¼ ÈÍÍÍÍÍ¼ ÈÍÍÍÍÍÍ¼ÈÍ¼  ÈÍ¼                       ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                ÜÛ    ÛÜ     ÜÛÛÛÛÛÛÛÛß                                                           ÛÛ"},
		{"ÛÛ                                                               ÛÛÛ    ÛÛÛ   ÛÛÛ    Ûß                                                             ÛÛ"},
		{"ÛÛ                                                               ÛÛÛ    ÛÛÛ   ÛÛÛ                                                                   ÛÛ"},
		{"ÛÛ                                                               ÛÛÛ    ÛÛÛ ßÛÛÛÛÛÛÛÛÛÛÛ                                                            ÛÛ"},
		{"ÛÛ                                                                ÛÛÜ  ÜÛÛ           ÛÛÛ                                                            ÛÛ"},
		{"ÛÛ                                                                 ÛÛÜÜÛÛ     ÜÛ     ÛÛÛ                                                            ÛÛ"},
		{"ÛÛ                                                                  ßÛÛß   ÜÛÛÛÛÛÛÛÛß                                                               ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                 ÛÛÛÜ      ÛÛ²     ÛÛ²²ÛÛÛÛÛ  ÛÛÛÜ    Û   ÛÛÛÛÛÛ                                                  ÛÛ"},
		{"ÛÛ                                                ±ÛÛÛÛÛÜÜ  ²ÛÛ±    ²ÛÛ±²Û   ß  ÛÛ ßÛ   Û ±ÛÛ    ±                                                  ÛÛ"},
		{"ÛÛ                                                ±ÛÛ  ßÛÛÜ ±ÛÛ°    ±ÛÛ±±ÛÛÛ   ²ÛÛ  ßÛ ÛÛ±° ²ÛÛÜ                                                    ÛÛ"},
		{"ÛÛ                                                °ÛÛÜÜÜÜÛÛ ±ÛÛ°    °ÛÛ°±²Û  Û ²ÛÛ±  ßÛÛÛ±  ±   ÛÛ±                                                 ÛÛ"},
		{"ÛÛ                                                ²Û   ²ÛÛ±°ÛÛÛÛÛÛ±°ÛÛ°°±ÛÛÛÛÛ±ÛÛ°   ²ÛÛ°±ÛÛÛÛÛÛ±±                                                  ÛÛ"},
		{"ÛÛ                                                ±±   ²±Û°° ±°²  °°²  °° ±° °° ±°   ± ± ± ±²± ± °                                                  ÛÛ"},
		{"ÛÛ                                                ±   ±± °° ° ±  ° ± ° ° °  °° °°   ° ±°° °±  ° °                                                   ÛÛ"},
		{"ÛÛ                                                °   ±     ° °    ± °   °      °   ° ° °  °  °                                                     ÛÛ"},
		{"ÛÛ                                                    °  °    °  ° °     °  °         °       °                                                     ÛÛ"},
		{"ÛÛ                                                             ÉÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ»                                                             ÛÛ"},
		{"ÛÛ                                                             º         PLAY         º                                                             ÛÛ"},
		{"ÛÛ                                                             ÈÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼                                                             ÛÛ"},
		{"ÛÛ                                                             ÉÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ»                                                             ÛÛ"},
		{"ÛÛ                                                             ºÛÛÛ> INSTRUCTIONS <ÛÛÛº                                                             ÛÛ"},
		{"ÛÛ                                                             ÈÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ¼                                                             ÛÛ"},
		{"ÛÛ                                                             ÉÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ»                                                             ÛÛ"},
		{"ÛÛ                                                             º        CREDITS       º                                                             ÛÛ"},
		{"ÛÛ                                                             ÈÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼                                                             ÛÛ"},
		{"ÛÛ                                                             ÉÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ»                                                             ÛÛ"},
		{"ÛÛ                                                             º         QUIT         º                                                             ÛÛ"},
		{"ÛÛ                                                             ÈÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼                                                             ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ"}
	};
	int i, j = 0;
	for (j = 0; j < 41; ++j)
		for (i = 0; i < 151; ++i)
			WindowsHelper_DrawCharacterInPosition(0x0F, UI[j][i], i, j);
}

/*Function to print main menu with 'QUIT' selection*/
void RenderMenuScreen_Cursor_Quit(void)
{
	char UI[][151] = {
		{"ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                            ÛÛÛÛÛÛÛ»ÛÛÛÛÛÛ»  ÛÛÛÛÛ»  ÛÛÛÛÛÛ»ÛÛÛÛÛÛÛ»    ÛÛÛÛÛÛ»  ÛÛÛÛÛ» ÛÛÛ»   ÛÛ» ÛÛÛÛÛÛ» ÛÛÛÛÛÛÛ»ÛÛÛÛÛÛ»                        ÛÛ"},
		{"ÛÛ                            ÛÛÉÍÍÍÍ¼ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛ»ÛÛÉÍÍÍÍ¼ÛÛÉÍÍÍÍ¼    ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛ»ÛÛÛÛ»  ÛÛºÛÛÉÍÍÍÍ¼ ÛÛÉÍÍÍÍ¼ÛÛÉÍÍÛÛ»                       ÛÛ"},
		{"ÛÛ                            ÛÛÛÛÛÛÛ»ÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÛºÛÛº     ÛÛÛÛÛ»      ÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÛºÛÛÉÛÛ» ÛÛºÛÛº  ÛÛÛ»ÛÛÛÛÛ»  ÛÛÛÛÛÛÉ¼                       ÛÛ"},
		{"ÛÛ                            ÈÍÍÍÍÛÛºÛÛÉÍÍÍ¼ ÛÛÉÍÍÛÛºÛÛº     ÛÛÉÍÍ¼      ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛºÛÛºÈÛÛ»ÛÛºÛÛº   ÛÛºÛÛÉÍÍ¼  ÛÛÉÍÍÛÛ»                       ÛÛ"},
		{"ÛÛ                            ÛÛÛÛÛÛÛºÛÛº     ÛÛº  ÛÛºÈÛÛÛÛÛÛ»ÛÛÛÛÛÛÛ»    ÛÛº  ÛÛºÛÛº  ÛÛºÛÛº ÈÛÛÛÛºÈÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÛ»ÛÛº  ÛÛº                       ÛÛ"},
		{"ÛÛ                            ÈÍÍÍÍÍÍ¼ÈÍ¼     ÈÍ¼  ÈÍ¼ ÈÍÍÍÍÍ¼ÈÍÍÍÍÍÍ¼    ÈÍ¼  ÈÍ¼ÈÍ¼  ÈÍ¼ÈÍ¼  ÈÍÍÍ¼ ÈÍÍÍÍÍ¼ ÈÍÍÍÍÍÍ¼ÈÍ¼  ÈÍ¼                       ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                ÜÛ    ÛÜ     ÜÛÛÛÛÛÛÛÛß                                                           ÛÛ"},
		{"ÛÛ                                                               ÛÛÛ    ÛÛÛ   ÛÛÛ    Ûß                                                             ÛÛ"},
		{"ÛÛ                                                               ÛÛÛ    ÛÛÛ   ÛÛÛ                                                                   ÛÛ"},
		{"ÛÛ                                                               ÛÛÛ    ÛÛÛ ßÛÛÛÛÛÛÛÛÛÛÛ                                                            ÛÛ"},
		{"ÛÛ                                                                ÛÛÜ  ÜÛÛ           ÛÛÛ                                                            ÛÛ"},
		{"ÛÛ                                                                 ÛÛÜÜÛÛ     ÜÛ     ÛÛÛ                                                            ÛÛ"},
		{"ÛÛ                                                                  ßÛÛß   ÜÛÛÛÛÛÛÛÛß                                                               ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                 ÛÛÛÜ      ÛÛ²     ÛÛ²²ÛÛÛÛÛ  ÛÛÛÜ    Û   ÛÛÛÛÛÛ                                                  ÛÛ"},
		{"ÛÛ                                                ±ÛÛÛÛÛÜÜ  ²ÛÛ±    ²ÛÛ±²Û   ß  ÛÛ ßÛ   Û ±ÛÛ    ±                                                  ÛÛ"},
		{"ÛÛ                                                ±ÛÛ  ßÛÛÜ ±ÛÛ°    ±ÛÛ±±ÛÛÛ   ²ÛÛ  ßÛ ÛÛ±° ²ÛÛÜ                                                    ÛÛ"},
		{"ÛÛ                                                °ÛÛÜÜÜÜÛÛ ±ÛÛ°    °ÛÛ°±²Û  Û ²ÛÛ±  ßÛÛÛ±  ±   ÛÛ±                                                 ÛÛ"},
		{"ÛÛ                                                ²Û   ²ÛÛ±°ÛÛÛÛÛÛ±°ÛÛ°°±ÛÛÛÛÛ±ÛÛ°   ²ÛÛ°±ÛÛÛÛÛÛ±±                                                  ÛÛ"},
		{"ÛÛ                                                ±±   ²±Û°° ±°²  °°²  °° ±° °° ±°   ± ± ± ±²± ± °                                                  ÛÛ"},
		{"ÛÛ                                                ±   ±± °° ° ±  ° ± ° ° °  °° °°   ° ±°° °±  ° °                                                   ÛÛ"},
		{"ÛÛ                                                °   ±     ° °    ± °   °      °   ° ° °  °  °                                                     ÛÛ"},
		{"ÛÛ                                                    °  °    °  ° °     °  °         °       °                                                     ÛÛ"},
		{"ÛÛ                                                             ÉÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ»                                                             ÛÛ"},
		{"ÛÛ                                                             º         PLAY         º                                                             ÛÛ"},
		{"ÛÛ                                                             ÈÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼                                                             ÛÛ"},
		{"ÛÛ                                                             ÉÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ»                                                             ÛÛ"},
		{"ÛÛ                                                             º     INSTRUCTIONS     º                                                             ÛÛ"},
		{"ÛÛ                                                             ÈÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼                                                             ÛÛ"},
		{"ÛÛ                                                             ÉÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ»                                                             ÛÛ"},
		{"ÛÛ                                                             º        CREDITS       º                                                             ÛÛ"},
		{"ÛÛ                                                             ÈÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼                                                             ÛÛ"},
		{"ÛÛ                                                             ÉÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ»                                                             ÛÛ"},
		{"ÛÛ                                                             ºÛÛÛ>     QUIT     <ÛÛÛº                                                             ÛÛ"},
		{"ÛÛ                                                             ÈÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ¼                                                             ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ"}
	};

	int i, j = 0;
	for (j = 0; j < 41; ++j)
		for (i = 0; i < 151; ++i)
			WindowsHelper_DrawCharacterInPosition(0x0F, UI[j][i], i, j);
}

/*Function to print main menu with 'CREDITS' selection*/
void RenderMenuScreen_Cursor_Credits(void)
{
	char UI[][151] = {
		{"ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                            ÛÛÛÛÛÛÛ»ÛÛÛÛÛÛ»  ÛÛÛÛÛ»  ÛÛÛÛÛÛ»ÛÛÛÛÛÛÛ»    ÛÛÛÛÛÛ»  ÛÛÛÛÛ» ÛÛÛ»   ÛÛ» ÛÛÛÛÛÛ» ÛÛÛÛÛÛÛ»ÛÛÛÛÛÛ»                        ÛÛ"},
		{"ÛÛ                            ÛÛÉÍÍÍÍ¼ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛ»ÛÛÉÍÍÍÍ¼ÛÛÉÍÍÍÍ¼    ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛ»ÛÛÛÛ»  ÛÛºÛÛÉÍÍÍÍ¼ ÛÛÉÍÍÍÍ¼ÛÛÉÍÍÛÛ»                       ÛÛ"},
		{"ÛÛ                            ÛÛÛÛÛÛÛ»ÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÛºÛÛº     ÛÛÛÛÛ»      ÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÛºÛÛÉÛÛ» ÛÛºÛÛº  ÛÛÛ»ÛÛÛÛÛ»  ÛÛÛÛÛÛÉ¼                       ÛÛ"},
		{"ÛÛ                            ÈÍÍÍÍÛÛºÛÛÉÍÍÍ¼ ÛÛÉÍÍÛÛºÛÛº     ÛÛÉÍÍ¼      ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛºÛÛºÈÛÛ»ÛÛºÛÛº   ÛÛºÛÛÉÍÍ¼  ÛÛÉÍÍÛÛ»                       ÛÛ"},
		{"ÛÛ                            ÛÛÛÛÛÛÛºÛÛº     ÛÛº  ÛÛºÈÛÛÛÛÛÛ»ÛÛÛÛÛÛÛ»    ÛÛº  ÛÛºÛÛº  ÛÛºÛÛº ÈÛÛÛÛºÈÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÛ»ÛÛº  ÛÛº                       ÛÛ"},
		{"ÛÛ                            ÈÍÍÍÍÍÍ¼ÈÍ¼     ÈÍ¼  ÈÍ¼ ÈÍÍÍÍÍ¼ÈÍÍÍÍÍÍ¼    ÈÍ¼  ÈÍ¼ÈÍ¼  ÈÍ¼ÈÍ¼  ÈÍÍÍ¼ ÈÍÍÍÍÍ¼ ÈÍÍÍÍÍÍ¼ÈÍ¼  ÈÍ¼                       ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                ÜÛ    ÛÜ     ÜÛÛÛÛÛÛÛÛß                                                           ÛÛ"},
		{"ÛÛ                                                               ÛÛÛ    ÛÛÛ   ÛÛÛ    Ûß                                                             ÛÛ"},
		{"ÛÛ                                                               ÛÛÛ    ÛÛÛ   ÛÛÛ                                                                   ÛÛ"},
		{"ÛÛ                                                               ÛÛÛ    ÛÛÛ ßÛÛÛÛÛÛÛÛÛÛÛ                                                            ÛÛ"},
		{"ÛÛ                                                                ÛÛÜ  ÜÛÛ           ÛÛÛ                                                            ÛÛ"},
		{"ÛÛ                                                                 ÛÛÜÜÛÛ     ÜÛ     ÛÛÛ                                                            ÛÛ"},
		{"ÛÛ                                                                  ßÛÛß   ÜÛÛÛÛÛÛÛÛß                                                               ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                 ÛÛÛÜ      ÛÛ²     ÛÛ²²ÛÛÛÛÛ  ÛÛÛÜ    Û   ÛÛÛÛÛÛ                                                  ÛÛ"},
		{"ÛÛ                                                ±ÛÛÛÛÛÜÜ  ²ÛÛ±    ²ÛÛ±²Û   ß  ÛÛ ßÛ   Û ±ÛÛ    ±                                                  ÛÛ"},
		{"ÛÛ                                                ±ÛÛ  ßÛÛÜ ±ÛÛ°    ±ÛÛ±±ÛÛÛ   ²ÛÛ  ßÛ ÛÛ±° ²ÛÛÜ                                                    ÛÛ"},
		{"ÛÛ                                                °ÛÛÜÜÜÜÛÛ ±ÛÛ°    °ÛÛ°±²Û  Û ²ÛÛ±  ßÛÛÛ±  ±   ÛÛ±                                                 ÛÛ"},
		{"ÛÛ                                                ²Û   ²ÛÛ±°ÛÛÛÛÛÛ±°ÛÛ°°±ÛÛÛÛÛ±ÛÛ°   ²ÛÛ°±ÛÛÛÛÛÛ±±                                                  ÛÛ"},
		{"ÛÛ                                                ±±   ²±Û°° ±°²  °°²  °° ±° °° ±°   ± ± ± ±²± ± °                                                  ÛÛ"},
		{"ÛÛ                                                ±   ±± °° ° ±  ° ± ° ° °  °° °°   ° ±°° °±  ° °                                                   ÛÛ"},
		{"ÛÛ                                                °   ±     ° °    ± °   °      °   ° ° °  °  °                                                     ÛÛ"},
		{"ÛÛ                                                    °  °    °  ° °     °  °         °       °                                                     ÛÛ"},
		{"ÛÛ                                                             ÉÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ»                                                             ÛÛ"},
		{"ÛÛ                                                             º         PLAY         º                                                             ÛÛ"},
		{"ÛÛ                                                             ÈÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼                                                             ÛÛ"},
		{"ÛÛ                                                             ÉÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ»                                                             ÛÛ"},
		{"ÛÛ                                                             º     INSTRUCTIONS     º                                                             ÛÛ"},
		{"ÛÛ                                                             ÈÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼                                                             ÛÛ"},
		{"ÛÛ                                                             ÉÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ»                                                             ÛÛ"},
		{"ÛÛ                                                             ºÛÛÛ>    CREDITS   <ÛÛÛº                                                             ÛÛ"},
		{"ÛÛ                                                             ÈÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ¼                                                             ÛÛ"},
		{"ÛÛ                                                             ÉÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ»                                                             ÛÛ"},
		{"ÛÛ                                                             º         QUIT         º                                                             ÛÛ"},
		{"ÛÛ                                                             ÈÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼                                                             ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ"}
	};

	int i, j = 0;
	for (j = 0; j < 41; ++j)
		for (i = 0; i < 151; ++i)
			WindowsHelper_DrawCharacterInPosition(0x0F, UI[j][i], i, j);
}


/* Function for print instructions */
void RenderHelpScreen(void)
{
	char UI1[][151] = { {
		"ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ" },
	{	"ÛÛ                                                                                                                                                  ÛÛ"},
	{	"ÛÛ                                                                                                                                                  ÛÛ"},
	{	"ÛÛ                          ÛÛ»ÛÛÛ»   ÛÛ»ÛÛÛÛÛÛÛ»ÛÛÛÛÛÛÛÛ»ÛÛÛÛÛÛ» ÛÛ»   ÛÛ» ÛÛÛÛÛÛ»ÛÛÛÛÛÛÛÛ»ÛÛ» ÛÛÛÛÛÛ» ÛÛÛ»   ÛÛ»ÛÛÛÛÛÛÛ»                          ÛÛ"},
	{	"ÛÛ                          ÛÛºÛÛÛÛ»  ÛÛºÛÛÉÍÍÍÍ¼ÈÍÍÛÛÉÍÍ¼ÛÛÉÍÍÛÛ»ÛÛº   ÛÛºÛÛÉÍÍÍÍ¼ÈÍÍÛÛÉÍÍ¼ÛÛºÛÛÉÍÍÍÛÛ»ÛÛÛÛ»  ÛÛºÛÛÉÍÍÍÍ¼                          ÛÛ"},
	{	"ÛÛ                          ÛÛºÛÛÉÛÛ» ÛÛºÛÛÛÛÛÛÛ»   ÛÛº   ÛÛÛÛÛÛÉ¼ÛÛº   ÛÛºÛÛº        ÛÛº   ÛÛºÛÛº   ÛÛºÛÛÉÛÛ» ÛÛºÛÛÛÛÛÛÛ»                          ÛÛ"},
	{	"ÛÛ                          ÛÛºÛÛºÈÛÛ»ÛÛºÈÍÍÍÍÛÛº   ÛÛº   ÛÛÉÍÍÛÛ»ÛÛº   ÛÛºÛÛº        ÛÛº   ÛÛºÛÛº   ÛÛºÛÛºÈÛÛ»ÛÛºÈÍÍÍÍÛÛº                          ÛÛ"},
	{	"ÛÛ                          ÛÛºÛÛº ÈÛÛÛÛºÛÛÛÛÛÛÛº   ÛÛº   ÛÛº  ÛÛºÈÛÛÛÛÛÛÉ¼ÈÛÛÛÛÛÛ»   ÛÛº   ÛÛºÈÛÛÛÛÛÛÉ¼ÛÛº ÈÛÛÛÛºÛÛÛÛÛÛÛº                          ÛÛ"},
	{	"ÛÛ                          ÈÍ¼ÈÍ¼  ÈÍÍÍ¼ÈÍÍÍÍÍÍ¼   ÈÍ¼   ÈÍ¼  ÈÍ¼ ÈÍÍÍÍÍ¼  ÈÍÍÍÍÍ¼   ÈÍ¼   ÈÍ¼ ÈÍÍÍÍÍ¼ ÈÍ¼  ÈÍÍÍ¼ÈÍÍÍÍÍÍ¼                          ÛÛ"},
	{	"ÛÛ                                                                                                                                                  ÛÛ"},
	{	"ÛÛ     ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                                  ÛÛ                                                                ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                 MOVE UP / DOWN   ÛÛ   UP ARROW / DOWN ARROW                                        ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                                  ÛÛ                                                                ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                          SHOOT   ÛÛ   SPACE BAR                                                    ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                                  ÛÛ                                                                ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                           BROWSE THROUGH STORE   ÛÛ   LEFT & RIGHT ARROW                                           ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                                  ÛÛ                                                                ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                            PURCHASE STORE ITEM   ÛÛ   B                                                            ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                                  ÛÛ                                                                ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                   INSTRUCTIONS   ÛÛ   TAB                                                          ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                                  ÛÛ                                                                ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                           QUIT   ÛÛ   ESC                                                          ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                                  ÛÛ                                                                ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                                                                                                    ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                         ALIEN SPECIES GUIDE                                                        ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                                                                                                    ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                 ÛÛ                               ÛÛ                                ÛÛ                              ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                 ÛÛ                               ÛÛ                                ÛÛ                              ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                 ÛÛ                               ÛÛ                                ÛÛ                              ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                 ÛÛ                               ÛÛ                                ÛÛ                              ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                 ÛÛ                               ÛÛ                                ÛÛ                              ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ             ABILITY:            ÛÛ            ABILITY:           ÛÛ            ABILITY:            ÛÛ           ABILITY:           ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ               NONE              ÛÛ          SELF-HEALING         ÛÛ         TELEPORTATION          ÛÛ        CHARGE FORWARD        ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                                                                                                    ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ     ÛÛ"},
	{	"ÛÛ                                                                                                                                                  ÛÛ"},
	{	"ÛÛ                                                                                                                    Press 'ESC' to go back...     ÛÛ"},
	{	"ÛÛ                                                                                                                                                  ÛÛ"},
	{	"ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ"}
	};

	/* Print the tutorial screen as a whole. */
	int i = 0, j = 0;
	for (j = 0; j < 41; ++j)
		for (i = 0; i < 151; ++i)
			WindowsHelper_DrawCharacterInPosition(0x0F, UI1[j][i], i, j);

	int enemyYPos = 28;

	/* Line 233 to 258: Prints the enemy figures respectively in their own colours */
	WindowsHelper_DrawCharacterInPosition(RED, (unsigned char)'‘', 26, enemyYPos + 1);
	WindowsHelper_DrawCharacterInPosition(RED, (unsigned char)'û', 25, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(RED, (unsigned char)'è', 26, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(RED, (unsigned char)'û', 27, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(RED, (unsigned char)'’', 26, enemyYPos + 3);

	WindowsHelper_DrawCharacterInPosition(YELLOW, (unsigned char)'”', 59, enemyYPos + 1);
	WindowsHelper_DrawCharacterInPosition(YELLOW, (unsigned char)'®', 58, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(YELLOW, (unsigned char)'™', 59, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(YELLOW, (unsigned char)'¯', 60, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(YELLOW, (unsigned char)'V', 59, enemyYPos + 3);

	WindowsHelper_DrawCharacterInPosition(YELLOW, (unsigned char)'ï', 92, enemyYPos + 1);
	WindowsHelper_DrawCharacterInPosition(YELLOW, (unsigned char)'À', 91, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(YELLOW, (unsigned char)'Ž', 92, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(YELLOW, (unsigned char)'Ù', 93, enemyYPos + 2);

	WindowsHelper_DrawCharacterInPosition(PURPLE, (unsigned char)'ª', 124, enemyYPos + 1);
	WindowsHelper_DrawCharacterInPosition(PURPLE, (unsigned char)'à', 125, enemyYPos + 1);
	WindowsHelper_DrawCharacterInPosition(PURPLE, (unsigned char)'©', 126, enemyYPos + 1);
	WindowsHelper_DrawCharacterInPosition(PURPLE, (unsigned char)'Ó', 124, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(PURPLE, (unsigned char)'×', 125, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(PURPLE, (unsigned char)'½', 126, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(PURPLE, (unsigned char)'ß', 124, enemyYPos + 3);
	WindowsHelper_DrawCharacterInPosition(PURPLE, (unsigned char)'Ð', 125, enemyYPos + 3);
	WindowsHelper_DrawCharacterInPosition(PURPLE, (unsigned char)'ß', 126, enemyYPos + 3);
}

/* Function for print instructions */
void RenderInGameHelpScreen(void)
{
	char UI1[][151] = { {
		"ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ" },
	{	"ÛÛ                                                                                                                                                  ÛÛ"},
	{	"ÛÛ                                                                                                                                                  ÛÛ"},
	{	"ÛÛ                          ÛÛ»ÛÛÛ»   ÛÛ»ÛÛÛÛÛÛÛ»ÛÛÛÛÛÛÛÛ»ÛÛÛÛÛÛ» ÛÛ»   ÛÛ» ÛÛÛÛÛÛ»ÛÛÛÛÛÛÛÛ»ÛÛ» ÛÛÛÛÛÛ» ÛÛÛ»   ÛÛ»ÛÛÛÛÛÛÛ»                          ÛÛ"},
	{	"ÛÛ                          ÛÛºÛÛÛÛ»  ÛÛºÛÛÉÍÍÍÍ¼ÈÍÍÛÛÉÍÍ¼ÛÛÉÍÍÛÛ»ÛÛº   ÛÛºÛÛÉÍÍÍÍ¼ÈÍÍÛÛÉÍÍ¼ÛÛºÛÛÉÍÍÍÛÛ»ÛÛÛÛ»  ÛÛºÛÛÉÍÍÍÍ¼                          ÛÛ"},
	{	"ÛÛ                          ÛÛºÛÛÉÛÛ» ÛÛºÛÛÛÛÛÛÛ»   ÛÛº   ÛÛÛÛÛÛÉ¼ÛÛº   ÛÛºÛÛº        ÛÛº   ÛÛºÛÛº   ÛÛºÛÛÉÛÛ» ÛÛºÛÛÛÛÛÛÛ»                          ÛÛ"},
	{	"ÛÛ                          ÛÛºÛÛºÈÛÛ»ÛÛºÈÍÍÍÍÛÛº   ÛÛº   ÛÛÉÍÍÛÛ»ÛÛº   ÛÛºÛÛº        ÛÛº   ÛÛºÛÛº   ÛÛºÛÛºÈÛÛ»ÛÛºÈÍÍÍÍÛÛº                          ÛÛ"},
	{	"ÛÛ                          ÛÛºÛÛº ÈÛÛÛÛºÛÛÛÛÛÛÛº   ÛÛº   ÛÛº  ÛÛºÈÛÛÛÛÛÛÉ¼ÈÛÛÛÛÛÛ»   ÛÛº   ÛÛºÈÛÛÛÛÛÛÉ¼ÛÛº ÈÛÛÛÛºÛÛÛÛÛÛÛº                          ÛÛ"},
	{	"ÛÛ                          ÈÍ¼ÈÍ¼  ÈÍÍÍ¼ÈÍÍÍÍÍÍ¼   ÈÍ¼   ÈÍ¼  ÈÍ¼ ÈÍÍÍÍÍ¼  ÈÍÍÍÍÍ¼   ÈÍ¼   ÈÍ¼ ÈÍÍÍÍÍ¼ ÈÍ¼  ÈÍÍÍ¼ÈÍÍÍÍÍÍ¼                          ÛÛ"},
	{	"ÛÛ                                                                                                                                                  ÛÛ"},
	{	"ÛÛ     ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                                  ÛÛ                                                                ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                 MOVE UP / DOWN   ÛÛ   UP ARROW / DOWN ARROW                                        ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                                  ÛÛ                                                                ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                          SHOOT   ÛÛ   SPACE BAR                                                    ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                                  ÛÛ                                                                ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                           BROWSE THROUGH STORE   ÛÛ   LEFT & RIGHT ARROW                                           ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                                  ÛÛ                                                                ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                            PURCHASE STORE ITEM   ÛÛ   B                                                            ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                                  ÛÛ                                                                ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                   INSTRUCTIONS   ÛÛ   TAB                                                          ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                                  ÛÛ                                                                ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                           QUIT   ÛÛ   ESC                                                          ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                                  ÛÛ                                                                ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                                                                                                    ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                         ALIEN SPECIES GUIDE                                                        ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                                                                                                    ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                 ÛÛ                               ÛÛ                                ÛÛ                              ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                 ÛÛ                               ÛÛ                                ÛÛ                              ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                 ÛÛ                               ÛÛ                                ÛÛ                              ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                 ÛÛ                               ÛÛ                                ÛÛ                              ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                 ÛÛ                               ÛÛ                                ÛÛ                              ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ             ABILITY:            ÛÛ            ABILITY:           ÛÛ            ABILITY:            ÛÛ           ABILITY:           ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ               NONE              ÛÛ          SELF-HEALING         ÛÛ         TELEPORTATION          ÛÛ        CHARGE FORWARD        ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛ                                                                                                                                    ÛÛ     ÛÛ"},
	{	"ÛÛ     ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ     ÛÛ"},
	{	"ÛÛ                                                                                                                                                  ÛÛ"},
	{	"ÛÛ                                                                                                                  Press 'Enter' to go back...     ÛÛ"},
	{	"ÛÛ                                                                                                                                                  ÛÛ"},
	{	"ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ"}
	};

	/* Print the tutorial screen as a whole. */
	int i = 0, j = 0;
	for (j = 0; j < 41; ++j)
		for (i = 0; i < 151; ++i)
			WindowsHelper_DrawCharacterInPosition(0x0F, UI1[j][i], i, j);

	int enemyYPos = 28;

	/* Line 233 to 258: Prints the enemy figures respectively in their own colours */
	WindowsHelper_DrawCharacterInPosition(RED, (unsigned char)'‘', 26, enemyYPos + 1);
	WindowsHelper_DrawCharacterInPosition(RED, (unsigned char)'û', 25, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(RED, (unsigned char)'è', 26, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(RED, (unsigned char)'û', 27, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(RED, (unsigned char)'’', 26, enemyYPos + 3);

	WindowsHelper_DrawCharacterInPosition(YELLOW, (unsigned char)'”', 59, enemyYPos + 1);
	WindowsHelper_DrawCharacterInPosition(YELLOW, (unsigned char)'®', 58, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(YELLOW, (unsigned char)'™', 59, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(YELLOW, (unsigned char)'¯', 60, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(YELLOW, (unsigned char)'V', 59, enemyYPos + 3);

	WindowsHelper_DrawCharacterInPosition(YELLOW, (unsigned char)'ï', 92, enemyYPos + 1);
	WindowsHelper_DrawCharacterInPosition(YELLOW, (unsigned char)'À', 91, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(YELLOW, (unsigned char)'Ž', 92, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(YELLOW, (unsigned char)'Ù', 93, enemyYPos + 2);

	WindowsHelper_DrawCharacterInPosition(PURPLE, (unsigned char)'ª', 124, enemyYPos + 1);
	WindowsHelper_DrawCharacterInPosition(PURPLE, (unsigned char)'à', 125, enemyYPos + 1);
	WindowsHelper_DrawCharacterInPosition(PURPLE, (unsigned char)'©', 126, enemyYPos + 1);
	WindowsHelper_DrawCharacterInPosition(PURPLE, (unsigned char)'Ó', 124, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(PURPLE, (unsigned char)'×', 125, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(PURPLE, (unsigned char)'½', 126, enemyYPos + 2);
	WindowsHelper_DrawCharacterInPosition(PURPLE, (unsigned char)'ß', 124, enemyYPos + 3);
	WindowsHelper_DrawCharacterInPosition(PURPLE, (unsigned char)'Ð', 125, enemyYPos + 3);
	WindowsHelper_DrawCharacterInPosition(PURPLE, (unsigned char)'ß', 126, enemyYPos + 3);
}

/* Function for print credits */
void RenderCreditsScreen(void)
{
	char UI[][151] = {
		{"ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                 All content © 2018 DigiPen Institute of Technology Singapore, all rights reserved.                               ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                              ÛÛÛÛÛÛ»ÛÛÛÛÛÛ» ÛÛÛÛÛÛÛ»ÛÛÛÛÛÛ» ÛÛ»ÛÛÛÛÛÛÛÛ»ÛÛÛÛÛÛÛ»                                                 ÛÛ"},
		{"ÛÛ                                             ÛÛÉÍÍÍÍ¼ÛÛÉÍÍÛÛ»ÛÛÉÍÍÍÍ¼ÛÛÉÍÍÛÛ»ÛÛºÈÍÍÛÛÉÍÍ¼ÛÛÉÍÍÍÍ¼                                                 ÛÛ"},
		{"ÛÛ                                             ÛÛº     ÛÛÛÛÛÛÉ¼ÛÛÛÛÛ»  ÛÛº  ÛÛºÛÛº   ÛÛº   ÛÛÛÛÛÛÛ»                                                 ÛÛ"},
		{"ÛÛ                                             ÛÛº     ÛÛÉÍÍÛÛ»ÛÛÉÍÍ¼  ÛÛº  ÛÛºÛÛº   ÛÛº   ÈÍÍÍÍÛÛº                                                 ÛÛ"},
		{"ÛÛ                                             ÈÛÛÛÛÛÛ»ÛÛº  ÛÛºÛÛÛÛÛÛÛ»ÛÛÛÛÛÛÉ¼ÛÛº   ÛÛº   ÛÛÛÛÛÛÛº                                                 ÛÛ"},
		{"ÛÛ                                              ÈÍÍÍÍÍ¼ÈÍ¼  ÈÍ¼ÈÍÍÍÍÍÍ¼ÈÍÍÍÍÍ¼ ÈÍ¼   ÈÍ¼   ÈÍÍÍÍÍÍ¼                                                 ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                     _____________programmer_____________                                                         ÛÛ"},
    	{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                Chua Zun Sheng                                                                    ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                               Eric Aw Yuh Liang                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                          Muhd Nur Syafaat Bin Mohd Saat                                                          ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                 Kok Ying Ying                                                                    ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                     _____________instructor_____________                                                         ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                  Logam Andy                                                                      ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                               Cheng Ding Xiang                                                                   ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                     _____________president_____________                                                          ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                Claude Comair                                                                     ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                     -------------THANK YOU-------------                                                          ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛ                                                                                                                                                  ÛÛ"},
		{"ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ"}
	};

	int i, j = 0;
	for (j = 0; j < 41; ++j)
		for (i = 0; i < 151; ++i)
			WindowsHelper_DrawCharacterInPosition(0x0F, UI[j][i], i, j);
}
